precursor_kEpsilonFine/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2880
(
(0.0759945 1.67034e-09 -2.51238e-10)
(0.0759944 -2.93133e-10 1.50822e-10)
(0.0759942 -1.3453e-09 6.2858e-11)
(0.098883 6.74376e-10 -3.01769e-10)
(0.098884 -1.13986e-09 8.06405e-11)
(0.098883 5.36073e-10 2.22183e-10)
(0.114197 -1.53111e-09 -3.15082e-10)
(0.114198 -2.17148e-09 7.01405e-11)
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    noSlipWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
