precursor_kEpsilonFine/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2880
(
0.000165952
0.000165952
0.00016595
0.00043036
0.000430369
0.000430362
0.00051239
0.000512397
...
)
;

boundaryField
{
    freeSurface
    {
        type            slip;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    sidewalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
192
(
0.000158824
0.000223809
0.000223809
0.000261736
0.000302291
0.000345521
0.000345521
0.000391338
...
)
;
    }
    noSlipWalls
    {
        type            kqRWallFunction;
        value           nonuniform List<scalar> 
90
(
0.000158824
0.000385304
0.000461313
0.000518023
0.000564342
0.000603576
0.000637987
0.000669271
...
)
;
    }
}


// ************************************************************************* //
